{"summary":[{"Objective":"\n\nObtain a software engineer internship where I can utilize my skills in functional design, testing and integration.\n\n"}],"education_and_training":[{"Education":"\n\nNew Jersey Institute of Technology , Newark, NJ Fall 2018\n\nBS, Computer Science and Computational Mathematics (Double major) GPA: 3.735\n\nRelevant coursework: Programming Language Concepts, Principles of Operating System, Computer Org. & Architect, Foundation of Computer Science II and Data Management System Desgin.\n\n"}],"skills":[{"Skills\n\nProgramming Languages":": JavaScript, SQL, Java, Python, Bash, C, and C++\n\nApplications: MySQL, Node.js, Sequelize, MongoDB, React.js, Git, and Microsoft Word\n\n"},{"Languages":": Fluent in Mandarin and English\n\n"}],"basics":{"address":["7239\n\nRidgefield, NJ 07657"],"gender":"male","phone":["952-715-7239"],"name":{"firstName":"Jimmy","surname":"Lu"},"title":"engineer","email":["qxl2@njit.edu"]},"extracurricular":[{"Volunteer Experience":"\n\nDinner with an Engineering Summer, 2016\n\nMentored and advised elementary school, middle school and high school students who are interested in STEM fields\n\nCoding Camp for Young Women Summer, 2016\n\nAdvised high school students in finding their passion within STEM fields\n\n"},{"Activities":"\/Leadership\n\nPresident , Chinese Undergraduate Student Association May 2016 – December 2016\n\nFounded the club with a group of students\n\nAssisted in planning and executing events throughout the school year\n\n"}],"work_experience":[{"date_start":"October, 2016","organization":"AMP","text":"\n\nAwarded second place in Computer and Mathematical Sciences.\n\n"},{"date_start":"September 2015","jobtitle":"Treasurer","date_end":"May 2016","text":"\n\nAssisted in planning and hosting 3 game tournaments\n\nBuilt communication between school Senate and club administration for funding\n\nAnalyzed players’ performance and provided critiques\n\nMember, Association of Computing Machinery 2014-2016\n"},{"Research Experience":"\/Project\n\nParticipatory Learning Approach May 2016 - Present\n\nRonald E. McNair Post-Baccalaureate Achievement Summer Research Program\n\nDesigned and implemented frontend page using React for data reallocation\n\nDesigned and deployed user testing for bugs and server functionality\n\nAssisted in designing and implementing algorithms using Sequelize\n\nAssisted in expanding an educational method to support complex workflow structure\n\nManaged MySQL database involving complex table relations\n\nPresentation\n\nNJIT Ninth International Undergraduate Summer Research Symposium July, 2016\n\n“Building a Flexible and Collaborative Online Learning System”\n\nPhiladelphia "}]}